In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
!ls ../data_all

AMZN.csv           apply_demo.csv     iris.csv           top5.csv
BABA.csv           city_weather.csv   movie_metadata.csv train.csv
Pokemon.csv        demo_duplicate.csv sales-funnel.xlsx  usa_flights.csv

In [5]:
df = pd.read_csv('../data_all/apply_demo.csv')

In [7]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [11]:
df.size

7978

In [13]:
s1 = Series(['a']*7978)

In [15]:
df['A'] = s1

In [18]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [22]:
df['A']=df['A'].apply(str.upper)
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [26]:
df['data'][0].strip().split(' ')

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [38]:
def foo(line):
    items = line.strip().split(' ')
    return Series([items[1], items[3], items[5]])

df_tmp = df['data'].apply(foo)

In [42]:
df_tmp = df_tmp.rename(columns={0:"Symbol", 1:"Seqno", 2:"Price"})
df_tmp.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [44]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [46]:
df_new = df.combine_first(df_tmp)

In [48]:
df_new.head()

   A Price Seqno Symbol                                data        time
0  A  1623     0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  A  1623     0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  A  1623     0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  A  1623     0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  A  1649     1   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

In [53]:
# del df_new['data']
del df_new['A']
df_new.head()

  Price Seqno Symbol        time
0  1623     0   APPL  1473411962
1  1623     0   APPL  1473411962
2  1623     0   APPL  1473411963
3  1623     0   APPL  1473411963
4  1649     1   APPL  1473411963

In [55]:
df_new.to_csv('../data_all/demo_duplicate.csv')

In [57]:
!ls ../data_all

AMZN.csv           apply_demo.csv     iris.csv           top5.csv
BABA.csv           city_weather.csv   movie_metadata.csv train.csv
Pokemon.csv        demo_duplicate.csv sales-funnel.xlsx  usa_flights.csv